InformationRegisters/СведенияОФайлах1САрхив.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СведенияОФайлах1САрхив</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидДокументаБИА</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовБИА</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеВыгружать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПечатнойФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПрисоединенныйФайл</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ИнтеграцияС1САрхивомРасширенный/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

#Область УправлениеДоступом

Процедура ЗаполнитьПоставляемыеПрофилиГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт
	
	ОписаниеПрофиля = ОписаниеПрофиляОтправкаДокументовВ1САрхив();
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	ОписаниеПрофиля = ОписаниеПрофиляАдминистрированиеОбменаС1САрхивом();
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

#КонецОбласти

#Область ВыгрузкаВАрхив

// См. ОбменСАрхивомПереопределяемый.ОбновитьВидыДокументовПриОбновленииКонфигурации.
Процедура ОбновитьВидыДокументовПриОбновленииКонфигурации(ПараметрОбработчика) Экспорт
	
	ИнтеграцияС1САрхивомБазовый.ОбновитьВидыДокументовПриОбновленииКонфигурации(ПараметрОбработчика);
	
	Справочники.ВидыДокументовБИА.НачальноеЗаполнение();
	
КонецПроцедуры

// См. ОбменСАрхивомПереопределяемый.ПриСозданииДокументовБИА.
Процедура СоздатьДокументыБИА(СсылкаНаОбъектИсточник, ДокументыБИА) Экспорт
	
	ИнтеграцияС1САрхивомБазовый.СоздатьДокументыБИА(СсылкаНаОбъектИсточник, ДокументыБИА);
	
	Если Не ДокументыБИА.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ПроизвольныеКадровыеПриказы") Тогда
		
		МодульПроизвольныеКадровыеПриказы = ОбщегоНазначения.ОбщийМодуль("ПроизвольныеКадровыеПриказы");
		МодульПроизвольныеКадровыеПриказы.СоздатьДокументыБИА(СсылкаНаОбъектИсточник, ДокументыБИА);
		
		Если Не ДокументыБИА.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТипыДокументовИсключений = Новый Массив;
	ТипыДокументовИсключений.Добавить(Тип("ДокументСсылка.ТабельУчетаРабочегоВремени"));
	ТипыДокументовИсключений.Добавить(Тип("ДокументСсылка.ПростойСотрудников"));
	
	Если Не ТипыДокументовИсключений.Найти(ТипЗнч(СсылкаНаОбъектИсточник)) = Неопределено Тогда
		
		ДокументыБИА = ИнтеграцияС1САрхивом.СоздатьДокументыБИАПоВладельцуФайлов(СсылкаНаОбъектИсточник,, ТипыДокументовИсключений);
		
	ИначеЕсли ТипЗнч(СсылкаНаОбъектИсточник) = Тип("СправочникСсылка.Сотрудники") Тогда
		
		ПараметрыДокумента = ИнтеграцияС1САрхивом.ПараметрыДокумента();
		ПараметрыДокумента.ВладелецФайлов = СсылкаНаОбъектИсточник;
		ДокументыБИА = ИнтеграцияС1САрхивом.СоздатьДокументыБИАПоВладельцуФайлов(СсылкаНаОбъектИсточник, ПараметрыДокумента);
		
	ИначеЕсли ТипЗнч(СсылкаНаОбъектИсточник) = Тип("СправочникСсылка.ФизическиеЛицаПрисоединенныеФайлы") Тогда
		
		СведенияОФайлах1САрхив = РегистрыСведений.СведенияОФайлах1САрхив.СведенияОФайлеДляВыгрузкиВАрхив(СсылкаНаОбъектИсточник, Истина);
		
		Если СведенияОФайлах1САрхив.НеВыгружать Тогда
			Возврат;
		КонецЕсли;
		
		Сотрудник = СведенияОФайлах1САрхив.Сотрудник;
		Если Не ЗначениеЗаполнено(Сотрудник) Тогда
			Возврат;
		КонецЕсли;
		
		ДанныеБИАШапка = Новый Структура;
		
		ДанныеБИАШапка.Вставить("ВидДокумента", СведенияОФайлах1САрхив.ВидДокументаБИА);
		ДанныеБИАШапка.Вставить("Организация", СведенияОФайлах1САрхив.Организация);
		ДанныеБИАШапка.Вставить("Дата", СведенияОФайлах1САрхив.Дата);
		
		Если Не ЗначениеЗаполнено(ДанныеБИАШапка.ВидДокумента) Или Не ЗначениеЗаполнено(ДанныеБИАШапка.Организация) Или Не ЗначениеЗаполнено(ДанныеБИАШапка.Дата) Тогда
			Возврат;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СведенияОФайлах1САрхив.Номер) Тогда
			ДанныеБИАШапка.Вставить("Номер", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(СведенияОФайлах1САрхив.Номер, Истина, Ложь));
		КонецЕсли;
		
		КадровыеДанныеСотрудников = ИнтеграцияС1САрхивом.КадровыеДанныеСотрудника(СведенияОФайлах1САрхив.Дата, Сотрудник);
		
		Подразделение = КадровыеДанныеСотрудников.Подразделение;
		
		Если ЗначениеЗаполнено(Подразделение) Тогда
			ДанныеБИАШапка.Вставить("Подразделение", Подразделение);
		КонецЕсли;
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьШтатноеРасписание") Тогда
			ДолжностьСотрудника = КадровыеДанныеСотрудников.ДолжностьПоШтатномуРасписанию.Должность;
		Иначе
			ДолжностьСотрудника = КадровыеДанныеСотрудников.Должность;
		КонецЕсли;
		
		ДанныеБИАШапка.Вставить("ЭтоЭлектронныйДокумент", Истина);
		ДанныеБИАШапка.Вставить("ОбъектОснование", СсылкаНаОбъектИсточник);
		
		ФИО = Сотрудник.ФизическоеЛицо.ФИО;
		
		ДанныеБИАШапка.Вставить("Заголовок", СтрШаблон(НСтр("ru = '%1 %2'"), ДанныеБИАШапка.ВидДокумента.Наименование, ФИО));
		ДанныеБИАШапка.Вставить("Содержание", СтрШаблон(НСтр("ru = '%1 %2'"), ДанныеБИАШапка.ВидДокумента.Наименование, ФИО));
		
		ДанныеБИАСвойства = Новый Массив;
		ДанныеБИАСвойства.Добавить(Новый Структура("Значение, ИмяСвойства, ПредставлениеСвойства", ДолжностьСотрудника, "Должность", НСтр("ru = 'Должность'")));
		
		ДанныеБИАФайлы = Новый Массив;
		ДанныеБИАФайлы.Добавить(Новый Структура("Файл", СсылкаНаОбъектИсточник));
		
		ДанныеБИАСубъектыПД = Новый Массив;
		ДанныеБИАСубъектыПД.Добавить(Новый Структура("ФизическоеЛицо", Сотрудник.ФизическоеЛицо));
		
		ДанныеБИА = Новый Структура;
		ДанныеБИА.Вставить("ДанныеБИАШапка", ДанныеБИАШапка);
		ДанныеБИА.Вставить("ДанныеБИАСвойства", ДанныеБИАСвойства);
		ДанныеБИА.Вставить("ДанныеБИАСубъектыПД", ДанныеБИАСубъектыПД);
		ДанныеБИА.Вставить("ДанныеБИАФайлы", ДанныеБИАФайлы);
		
		ДокументБИА = ИнтеграцияС1САрхивом.СоздатьДокументБИА(ДанныеБИА);
		Если Не ДокументБИА = Неопределено Тогда
			ДокументыБИА.Добавить(ДокументБИА);
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(СсылкаНаОбъектИсточник) = Тип("ДокументСсылка.ВедомостьНаВыплатуЗарплатыПеречислением") Тогда
		
		ПараметрыДокумента = ИнтеграцияС1САрхивом.ПараметрыДокумента();
		ПараметрыДокумента.Списочный = Истина;
		ПараметрыДокумента.ИмяТабличнойЧастиСотрудники = "Зарплата";
		
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Подразделение", "Подразделение");
		
		ДокументыБИА = ИнтеграцияС1САрхивом.СоздатьДокументыБИАПоВладельцуФайлов(СсылкаНаОбъектИсточник, ПараметрыДокумента);
		
	ИначеЕсли ТипЗнч(СсылкаНаОбъектИсточник) = Тип("ДокументСсылка.ВедомостьНаВыплатуЗарплатыРаздатчиком") Тогда
		
		ПараметрыДокумента = ИнтеграцияС1САрхивом.ПараметрыДокумента();
		ПараметрыДокумента.Списочный = Истина;
		ПараметрыДокумента.ИмяТабличнойЧастиСотрудники = "Зарплата";
		
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Подразделение", "Подразделение");
		
		ДокументыБИА = ИнтеграцияС1САрхивом.СоздатьДокументыБИАПоВладельцуФайлов(СсылкаНаОбъектИсточник, ПараметрыДокумента);
		
	ИначеЕсли ТипЗнч(СсылкаНаОбъектИсточник) = Тип("ДокументСсылка.ВозвратИзОтпускаПоУходуЗаРебенком") Тогда
		
		ПараметрыДокумента = ИнтеграцияС1САрхивом.ПараметрыДокумента();
		ПараметрыДокумента.Списочный = Ложь;
		
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Дата возврата", "ДатаВозврата");
		
		ДокументыБИА = ИнтеграцияС1САрхивом.СоздатьДокументыБИАПоВладельцуФайлов(СсылкаНаОбъектИсточник, ПараметрыДокумента);
		
	ИначеЕсли ТипЗнч(СсылкаНаОбъектИсточник) = Тип("ДокументСсылка.ПриостановлениеТрудовыхДоговоровКонтрактов") Тогда
		
		ПараметрыДокумента = ИнтеграцияС1САрхивом.ПараметрыДокумента();
		ПараметрыДокумента.Списочный = Истина;
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Дата начала", "ДатаНачала");
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Дата окончания", "ДатаОкончания");
		
		ДокументыБИА = ИнтеграцияС1САрхивом.СоздатьДокументыБИАПоВладельцуФайлов(СсылкаНаОбъектИсточник, ПараметрыДокумента);
		
	ИначеЕсли ТипЗнч(СсылкаНаОбъектИсточник) = Тип("ДокументСсылка.ВозобновлениеТрудовыхДоговоровКонтрактов") Тогда
		
		ПараметрыДокумента = ИнтеграцияС1САрхивом.ПараметрыДокумента();
		ПараметрыДокумента.Списочный = Истина;
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Дата возобновления", "ДатаВозобновления");
		
		ДокументыБИА = ИнтеграцияС1САрхивом.СоздатьДокументыБИАПоВладельцуФайлов(СсылкаНаОбъектИсточник, ПараметрыДокумента);
		
	ИначеЕсли ТипЗнч(СсылкаНаОбъектИсточник) = Тип("ДокументСсылка.ВосстановлениеВДолжности") Тогда
		
		ПараметрыДокумента = ИнтеграцияС1САрхивом.ПараметрыДокумента();
		ПараметрыДокумента.Списочный = Ложь;
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Дата восстановления", "ДатаВосстановления");
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Подразделение", "Подразделение");
		Если ПолучитьФункциональнуюОпцию("ИспользоватьШтатноеРасписание") Тогда
			ПараметрыДокумента.ДополнительныеСвойства.Вставить("Должность", "ДолжностьПоШтатномуРасписанию");
		Иначе
			ПараметрыДокумента.ДополнительныеСвойства.Вставить("Должность", "Должность");
		КонецЕсли;
		
		ДокументыБИА = ИнтеграцияС1САрхивом.СоздатьДокументыБИАПоВладельцуФайлов(СсылкаНаОбъектИсточник, ПараметрыДокумента);
		
	ИначеЕсли ТипЗнч(СсылкаНаОбъектИсточник) = Тип("ДокументСсылка.ИзменениеГрафикаРаботыСписком") Тогда
		
		ПараметрыДокумента = ИнтеграцияС1САрхивом.ПараметрыДокумента();
		ПараметрыДокумента.Списочный = Истина;
		ПараметрыДокумента.ИмяТабличнойЧастиСотрудники = "Сотрудники";
		
		ДокументыБИА = ИнтеграцияС1САрхивом.СоздатьДокументыБИАПоВладельцуФайлов(СсылкаНаОбъектИсточник, ПараметрыДокумента);
		
	ИначеЕсли ТипЗнч(СсылкаНаОбъектИсточник) = Тип("ДокументСсылка.ИзменениеКвалификационногоРазряда") Тогда
		
		ПараметрыДокумента = ИнтеграцияС1САрхивом.ПараметрыДокумента();
		ПараметрыДокумента.Списочный = Ложь;
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Дата изменения", "ДатаИзменения");
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Разряд (категория)", "РазрядКатегория");
		
		ДокументыБИА = ИнтеграцияС1САрхивом.СоздатьДокументыБИАПоВладельцуФайлов(СсылкаНаОбъектИсточник, ПараметрыДокумента);
		
	ИначеЕсли ТипЗнч(СсылкаНаОбъектИсточник) = Тип("ДокументСсылка.ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенком") Тогда
		
		ПараметрыДокумента = ИнтеграцияС1САрхивом.ПараметрыДокумента();
		ПараметрыДокумента.Списочный = Ложь;
		
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Дата изменения", "ДатаИзменения");
		
		ДокументыБИА = ИнтеграцияС1САрхивом.СоздатьДокументыБИАПоВладельцуФайлов(СсылкаНаОбъектИсточник, ПараметрыДокумента);
		
	ИначеЕсли ТипЗнч(СсылкаНаОбъектИсточник) = Тип("ДокументСсылка.КадровыйПереводСписком") Тогда
		
		ПараметрыДокумента = ИнтеграцияС1САрхивом.ПараметрыДокумента();
		ПараметрыДокумента.Списочный = Истина;
		
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Подразделение", "Подразделение");
		Если ПолучитьФункциональнуюОпцию("ИспользоватьШтатноеРасписание") Тогда
			ПараметрыДокумента.ДополнительныеСвойства.Вставить("Должность", "ДолжностьПоШтатномуРасписанию");
		Иначе
			ПараметрыДокумента.ДополнительныеСвойства.Вставить("Должность", "Должность");
		КонецЕсли;
		
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Дата перевода", "ДатаНачала");
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Дата возврата", "ДатаОкончания");
		
		ДокументыБИА = ИнтеграцияС1САрхивом.СоздатьДокументыБИАПоВладельцуФайлов(СсылкаНаОбъектИсточник, ПараметрыДокумента);
		
	ИначеЕсли ТипЗнч(СсылкаНаОбъектИсточник) = Тип("ДокументСсылка.Командировка") Тогда
		
		ПараметрыДокумента = ИнтеграцияС1САрхивом.ПараметрыДокумента();
		ПараметрыДокумента.Списочный = Ложь;
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Дата командировки", "ДатаКомандировки");
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Дата начала", "ДатаНачала");
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Дата окончания", "ДатаОкончания");
		
		ДокументыБИА = ИнтеграцияС1САрхивом.СоздатьДокументыБИАПоВладельцуФайлов(СсылкаНаОбъектИсточник, ПараметрыДокумента);
		
	ИначеЕсли ТипЗнч(СсылкаНаОбъектИсточник) = Тип("ДокументСсылка.КомандировкиСотрудников") Тогда
		
		ПараметрыДокумента = ИнтеграцияС1САрхивом.ПараметрыДокумента();
		ПараметрыДокумента.Списочный = Истина;
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Дата начала", "ДатаНачала");
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Дата окончания", "ДатаОкончания");
		
		ДокументыБИА = ИнтеграцияС1САрхивом.СоздатьДокументыБИАПоВладельцуФайлов(СсылкаНаОбъектИсточник, ПараметрыДокумента);
		
	ИначеЕсли ТипЗнч(СсылкаНаОбъектИсточник) = Тип("ДокументСсылка.МатериальнаяПомощь") Тогда
		
		ПараметрыДокумента = ИнтеграцияС1САрхивом.ПараметрыДокумента();
		ПараметрыДокумента.Списочный = Истина;
		ПараметрыДокумента.ИмяТабличнойЧастиСотрудники = "Начисления";
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Подразделение", "Подразделение");
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Дата начала", "ДатаНачала");
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Дата окончания", "ДатаОкончания");
		
		ДокументыБИА = ИнтеграцияС1САрхивом.СоздатьДокументыБИАПоВладельцуФайлов(СсылкаНаОбъектИсточник, ПараметрыДокумента);
		
	ИначеЕсли ТипЗнч(СсылкаНаОбъектИсточник) = Тип("ДокументСсылка.ОплатаДнейУходаЗаДетьмиИнвалидами") Тогда
		
		ПараметрыДокумента = ИнтеграцияС1САрхивом.ПараметрыДокумента();
		ПараметрыДокумента.Списочный = Ложь;
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Дата начала", "ДатаНачала");
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Дата окончания", "ДатаОкончания");
		
		ДокументыБИА = ИнтеграцияС1САрхивом.СоздатьДокументыБИАПоВладельцуФайлов(СсылкаНаОбъектИсточник, ПараметрыДокумента);
		
	ИначеЕсли ТипЗнч(СсылкаНаОбъектИсточник) = Тип("ДокументСсылка.ОплатаПоСреднемуЗаработку") Тогда
		
		ПараметрыДокумента = ИнтеграцияС1САрхивом.ПараметрыДокумента();
		ПараметрыДокумента.Списочный = Ложь;
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Дата начала", "ДатаНачалаОсновногоОтпуска");
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Дата окончания", "ДатаОкончанияОсновногоОтпуска");
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Дата отсутствия", "ДатаОтсутствия");
		
		ДокументыБИА = ИнтеграцияС1САрхивом.СоздатьДокументыБИАПоВладельцуФайлов(СсылкаНаОбъектИсточник, ПараметрыДокумента);
		
	ИначеЕсли ТипЗнч(СсылкаНаОбъектИсточник) = Тип("ДокументСсылка.ОплатаПоСреднемуЗаработкуСписком") Тогда
		
		ПараметрыДокумента = ИнтеграцияС1САрхивом.ПараметрыДокумента();
		ПараметрыДокумента.Списочный = Истина;
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Дата начала", "ДатаНачалаОсновногоОтпуска");
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Дата окончания", "ДатаОкончанияОсновногоОтпуска");
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Дата отсутствия", "ДатаОтсутствия");
		
		ДокументыБИА = ИнтеграцияС1САрхивом.СоздатьДокументыБИАПоВладельцуФайлов(СсылкаНаОбъектИсточник, ПараметрыДокумента);
		
	ИначеЕсли ТипЗнч(СсылкаНаОбъектИсточник) = Тип("ДокументСсылка.Отгул") Тогда
		
		ПараметрыДокумента = ИнтеграцияС1САрхивом.ПараметрыДокумента();
		ПараметрыДокумента.Списочный = Ложь;
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Подразделение", "Подразделение");
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Дата начала", "ДатаНачала");
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Дата начала", "ДатаОкончания");
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Дата отсутствия", "ДатаОтсутствия");
		
		ДокументыБИА = ИнтеграцияС1САрхивом.СоздатьДокументыБИАПоВладельцуФайлов(СсылкаНаОбъектИсточник, ПараметрыДокумента);
		
	ИначеЕсли ТипЗнч(СсылкаНаОбъектИсточник) = Тип("ДокументСсылка.ОтгулСписком") Тогда
		
		ПараметрыДокумента = ИнтеграцияС1САрхивом.ПараметрыДокумента();
		ПараметрыДокумента.Списочный = Истина;
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Дата начала", "ДатаНачала");
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Дата начала", "ДатаОкончания");
		
		ДокументыБИА = ИнтеграцияС1САрхивом.СоздатьДокументыБИАПоВладельцуФайлов(СсылкаНаОбъектИсточник, ПараметрыДокумента);
		
	ИначеЕсли ТипЗнч(СсылкаНаОбъектИсточник) = Тип("ДокументСсылка.ОтменаСовмещения") Тогда
		
		ПараметрыДокумента = ИнтеграцияС1САрхивом.ПараметрыДокумента();
		ПараметрыДокумента.Списочный = Ложь;
		ПараметрыДокумента.ИмяРеквизитаСотрудник = "СовмещающийСотрудник";
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Дата отмены", "ДатаОтмены");
		
		ДокументыБИА = ИнтеграцияС1САрхивом.СоздатьДокументыБИАПоВладельцуФайлов(СсылкаНаОбъектИсточник, ПараметрыДокумента);
		
	ИначеЕсли ТипЗнч(СсылкаНаОбъектИсточник) = Тип("ДокументСсылка.ОтпускаСотрудников") Тогда
		
		ПараметрыДокумента = ИнтеграцияС1САрхивом.ПараметрыДокумента();
		ПараметрыДокумента.Списочный = Истина;
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Дата начала", "ДатаНачала");
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Дата окончания", "ДатаОкончания");
		
		ДокументыБИА = ИнтеграцияС1САрхивом.СоздатьДокументыБИАПоВладельцуФайлов(СсылкаНаОбъектИсточник, ПараметрыДокумента);
		
	ИначеЕсли ТипЗнч(СсылкаНаОбъектИсточник) = Тип("ДокументСсылка.ОтпускБезСохраненияОплатыСписком") Тогда
		
		ПараметрыДокумента = ИнтеграцияС1САрхивом.ПараметрыДокумента();
		ПараметрыДокумента.Списочный = Истина;
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Дата начала", "ДатаНачала");
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Дата окончания", "ДатаОкончания");
		
		ДокументыБИА = ИнтеграцияС1САрхивом.СоздатьДокументыБИАПоВладельцуФайлов(СсылкаНаОбъектИсточник, ПараметрыДокумента);
		
	ИначеЕсли ТипЗнч(СсылкаНаОбъектИсточник) = Тип("ДокументСсылка.ОтпускПоУходуЗаРебенком") Тогда
		
		ПараметрыДокумента = ИнтеграцияС1САрхивом.ПараметрыДокумента();
		ПараметрыДокумента.Списочный = Ложь;
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Дата начала", "ДатаНачала");
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Дата окончания", "ДатаОкончания");
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Дата окончания пособия до полутора лет", "ДатаОкончанияПособияДоПолутораЛет");
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Дата окончания пособия до трех лет", "ДатаОкончанияПособияДоТрехЛет");
		
		ДокументыБИА = ИнтеграцияС1САрхивом.СоздатьДокументыБИАПоВладельцуФайлов(СсылкаНаОбъектИсточник, ПараметрыДокумента);
		
	ИначеЕсли ТипЗнч(СсылкаНаОбъектИсточник) = Тип("ДокументСсылка.ПриемНаРаботуСписком") Тогда
		
		ПараметрыДокумента = ИнтеграцияС1САрхивом.ПараметрыДокумента();
		ПараметрыДокумента.Списочный = Истина;
		ПараметрыДокумента.ИмяТабличнойЧастиСотрудники = "Сотрудники";
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Дата приема", "ДатаПриема");
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Подразделение", "Подразделение");
		Если ПолучитьФункциональнуюОпцию("ИспользоватьШтатноеРасписание") Тогда
			ПараметрыДокумента.ДополнительныеСвойства.Вставить("Должность", "ДолжностьПоШтатномуРасписанию");
		Иначе
			ПараметрыДокумента.ДополнительныеСвойства.Вставить("Должность", "Должность");
		КонецЕсли;
		
		ДокументыБИА = ИнтеграцияС1САрхивом.СоздатьДокументыБИАПоВладельцуФайлов(СсылкаНаОбъектИсточник, ПараметрыДокумента);
		
	ИначеЕсли ТипЗнч(СсылкаНаОбъектИсточник) = Тип("ДокументСсылка.ПриостановлениеТрудовыхДоговоровКонтрактов") Тогда
		
		ПараметрыДокумента = ИнтеграцияС1САрхивом.ПараметрыДокумента();
		ПараметрыДокумента.Списочный = Истина;
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Дата начала", "ДатаНачала");
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Дата окончания", "ДатаОкончания");
		
		ДокументыБИА = ИнтеграцияС1САрхивом.СоздатьДокументыБИАПоВладельцуФайлов(СсылкаНаОбъектИсточник, ПараметрыДокумента);
		
	ИначеЕсли ТипЗнч(СсылкаНаОбъектИсточник) = Тип("ДокументСсылка.ПрогулНеявка") Тогда
		
		ПараметрыДокумента = ИнтеграцияС1САрхивом.ПараметрыДокумента();
		ПараметрыДокумента.Списочный = Ложь;
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Дата начала", "ДатаНачала");
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Дата окончания", "ДатаОкончания");
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Дата отсутствия", "ДатаОтсутствия");
		
		ДокументыБИА = ИнтеграцияС1САрхивом.СоздатьДокументыБИАПоВладельцуФайлов(СсылкаНаОбъектИсточник, ПараметрыДокумента);
		
	ИначеЕсли ТипЗнч(СсылкаНаОбъектИсточник) = Тип("ДокументСсылка.ПрогулНеявкаСписком") Тогда
		
		ПараметрыДокумента = ИнтеграцияС1САрхивом.ПараметрыДокумента();
		ПараметрыДокумента.Списочный = Истина;
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Дата начала", "ДатаНачала");
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Дата окончания", "ДатаОкончания");
		
		ДокументыБИА = ИнтеграцияС1САрхивом.СоздатьДокументыБИАПоВладельцуФайлов(СсылкаНаОбъектИсточник, ПараметрыДокумента);
		
	ИначеЕсли ТипЗнч(СсылкаНаОбъектИсточник) = Тип("ДокументСсылка.ПростойСотрудников") Тогда
		
		ДокументыБИА = ИнтеграцияС1САрхивом.СоздатьДокументыБИАПоВладельцуФайлов(СсылкаНаОбъектИсточник);
		
	ИначеЕсли ТипЗнч(СсылкаНаОбъектИсточник) = Тип("ДокументСсылка.Совмещение") Тогда
		
		ПараметрыДокумента = ИнтеграцияС1САрхивом.ПараметрыДокумента();
		ПараметрыДокумента.Списочный = Ложь;
		ПараметрыДокумента.ИмяРеквизитаСотрудник = "СовмещающийСотрудник";
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Дата начала", "ДатаНачала");
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Дата окончания", "ДатаОкончания");
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Совмещающий сотрудник", "СовмещающийСотрудник");
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Отсутствующий сотрудник", "ОтсутствующийСотрудник");
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Совмещаемая должность", "СовмещаемаяДолжность");
		
		ДокументыБИА = ИнтеграцияС1САрхивом.СоздатьДокументыБИАПоВладельцуФайлов(СсылкаНаОбъектИсточник, ПараметрыДокумента);
		
	ИначеЕсли ТипЗнч(СсылкаНаОбъектИсточник) = Тип("ДокументСсылка.ТабельУчетаРабочегоВремени") Тогда
		
		ДокументыБИА = ИнтеграцияС1САрхивом.СоздатьДокументыБИАПоВладельцуФайлов(СсылкаНаОбъектИсточник);
		
	ИначеЕсли ТипЗнч(СсылкаНаОбъектИсточник) = Тип("ДокументСсылка.УвольнениеСписком") Тогда
		
		ПараметрыДокумента = ИнтеграцияС1САрхивом.ПараметрыДокумента();
		ПараметрыДокумента.Списочный = Истина;
		ПараметрыДокумента.ДополнительныеСвойства.Вставить("Дата увольнения", "ДатаУвольнения");
		
		ДокументыБИА = ИнтеграцияС1САрхивом.СоздатьДокументыБИАПоВладельцуФайлов(СсылкаНаОбъектИсточник, ПараметрыДокумента);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ДанныеТрудовогоДоговора(СсылкаНаДокумент, Сотрудник) Экспорт
	
	Если Не ОбщегоНазначения.ЕстьРеквизитОбъекта("ТрудовойДоговорНомер", Метаданные.Документы.ПриемНаРаботу) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПриемНаРаботу.ТрудовойДоговорНомер КАК ТрудовойДоговорНомер,
	|	ПриемНаРаботу.ТрудовойДоговорДата КАК ТрудовойДоговорДата
	|ИЗ
	|	Документ.ПриемНаРаботу КАК ПриемНаРаботу
	|ГДЕ
	|	ПриемНаРаботу.Ссылка = &Ссылка
	|	И ПриемНаРаботу.Сотрудник = &Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПриемНаРаботуСпискомСотрудники.ТрудовойДоговорНомер,
	|	ПриемНаРаботуСпискомСотрудники.ТрудовойДоговорДата
	|ИЗ
	|	Документ.ПриемНаРаботуСписком.Сотрудники КАК ПриемНаРаботуСпискомСотрудники
	|ГДЕ
	|	ПриемНаРаботуСпискомСотрудники.Ссылка = &Ссылка
	|	И ПриемНаРаботуСпискомСотрудники.Сотрудник = &Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КадровыйПеревод.ТрудовойДоговорНомер,
	|	КадровыйПеревод.ТрудовойДоговорДата
	|ИЗ
	|	Документ.КадровыйПеревод КАК КадровыйПеревод
	|ГДЕ
	|	КадровыйПеревод.Ссылка = &Ссылка
	|	И КадровыйПеревод.Сотрудник = &Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КадровыйПереводСпискомСотрудники.ТрудовойДоговорНомер,
	|	КадровыйПереводСпискомСотрудники.ТрудовойДоговорДата
	|ИЗ
	|	Документ.КадровыйПереводСписком.Сотрудники КАК КадровыйПереводСпискомСотрудники
	|ГДЕ
	|	КадровыйПереводСпискомСотрудники.Ссылка = &Ссылка
	|	И КадровыйПереводСпискомСотрудники.Сотрудник = &Сотрудник";
	
	ДанныеТрудовогоДоговора = Неопределено;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДанныеТрудовогоДоговора = Новый Структура("ТрудовойДоговорНомер, ТрудовойДоговорДата");
		ЗаполнитьЗначенияСвойств(ДанныеТрудовогоДоговора, Выборка);
	КонецЕсли;
	
	Возврат ДанныеТрудовогоДоговора;
	
КонецФункции

// См. ОбменСАрхивомПереопределяемый.ПриСозданииНаСервере.
Процедура ПриСозданииНаСервере(Форма, ПараметрыРазмещения, ЭтоФормаОбъекта) Экспорт
	
	Если Не ИнтеграцияС1САрхивомВызовСервера.ИнтеграцияС1САрхивомИспользуется() Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПриСозданииНаСервереФормыСписка(Форма, ИмяСписка = "Список", ИмяКолонкиОбъекта = Неопределено) Экспорт

	Если Не ИнтеграцияС1САрхивомВызовСервера.ИнтеграцияС1САрхивомИспользуется() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ИнтеграцияС1САрхивом.ДоступноЧтениеДокументовОтправленныхВ1САрхив() Тогда
		Возврат;
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы")
		И ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.КадровыйУчет.СпискиСотрудников") Тогда
		
		МодульСпискиСотрудников = ОбщегоНазначения.ОбщийМодуль("СпискиСотрудников");
		МодульСпискиСотрудников.ДобавитьКолонкиИнтеграцииС1САрхивом(Форма, ИмяСписка);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ОписаниеПрофиляОтправкаДокументовВ1САрхив(ПраваНаИнтерфейс = Ложь)
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = ИдентификаторПрофиляОтправкаДокументовВ1САрхив();
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Отправка документов в 1С:Архив'");
	
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляОбязательныеРоли(ОписаниеПрофиля);
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ОтправкаДокументовВ1САрхив", "ИнтеграцияС1САрхивом");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ПросмотрПротоколовОтправкиВКонтролирующиеОрганы", "РегламентированнаяОтчетность");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ПодсистемаКадры", "ЗарплатаКадрыПриложения.ЗарплатаКадрыКомандныйИнтерфейс");
	
	Возврат ОписаниеПрофиля;
	
КонецФункции

Функция ОписаниеПрофиляАдминистрированиеОбменаС1САрхивом(ПраваНаИнтерфейс = Ложь)
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = ИдентификаторПрофиляАдминистрированиеОбменаС1САрхивом();
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Администрирование обмена с 1С:Архивом'");
	
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляОбязательныеРоли(ОписаниеПрофиля);
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "АдминистрированиеОбменаС1САрхивом", "ИнтеграцияС1САрхивом");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ПросмотрПротоколовОтправкиВКонтролирующиеОрганы", "РегламентированнаяОтчетность");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ПодсистемаКадры", "ЗарплатаКадрыПриложения.ЗарплатаКадрыКомандныйИнтерфейс");
	
	Возврат ОписаниеПрофиля;
	
КонецФункции

Функция ИдентификаторПрофиляАдминистрированиеОбменаС1САрхивом()
	Возврат "a79cd1b0-c7a1-416d-be3a-c1793402fe1e";
КонецФункции

Функция ИдентификаторПрофиляОтправкаДокументовВ1САрхив()
	Возврат "8f65c459-39d1-43ca-a7eb-da988fe0d458";
КонецФункции

Функция СоздатьДокументБИАФайлаДокументаИсключения(Файл) Экспорт
	
	Перем Подразделение;
	
	СформированныеДокументыБИА = ИнтеграцияС1САрхивомБазовый.СоздатьДокументБИАФайлаДокументаИсключения(Файл);
	Если Не СформированныеДокументыБИА = Неопределено Тогда
		Возврат СформированныеДокументыБИА;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);
	
	СформированныеДокументыБИА = Новый Массив;
	
	Если ТипЗнч(Файл) = Тип("СправочникСсылка.ПростойСотрудниковПрисоединенныеФайлы") Тогда
		
		СведенияОФайлах1САрхив = РегистрыСведений.СведенияОФайлах1САрхив.СведенияОФайлеДляВыгрузкиВАрхив(Файл, Истина);
		
		Если СведенияОФайлах1САрхив.НеВыгружать Тогда
			Возврат СформированныеДокументыБИА;
		КонецЕсли;
		
		ДанныеБИАШапка = Новый Структура;
		
		ДанныеБИАШапка.Вставить("ВидДокумента", СведенияОФайлах1САрхив.ВидДокументаБИА);
		ДанныеБИАШапка.Вставить("Организация", СведенияОФайлах1САрхив.Организация);
		ДанныеБИАШапка.Вставить("Дата", СведенияОФайлах1САрхив.Дата);
		
		Если Не ЗначениеЗаполнено(ДанныеБИАШапка.ВидДокумента) Или Не ЗначениеЗаполнено(ДанныеБИАШапка.Организация) Или Не ЗначениеЗаполнено(ДанныеБИАШапка.Дата) Тогда
			Возврат СформированныеДокументыБИА;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СведенияОФайлах1САрхив.Номер) Тогда
			ДанныеБИАШапка.Вставить("Номер", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(СведенияОФайлах1САрхив.Номер, Истина, Ложь));
		КонецЕсли;
		
		ВладелецФайла = Файл.ВладелецФайла;
		Если ВладелецФайла.Подразделение.Пустая() Тогда
			Для Каждого СтрокаНачисления Из ВладелецФайла.Начисления Цикл
				Если Подразделение = Неопределено Тогда
					Подразделение = СтрокаНачисления.Подразделение;
				ИначеЕсли Не Подразделение = СтрокаНачисления.Подразделение Тогда
					Подразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
				КонецЕсли;
			КонецЦикла;
		Иначе
			Подразделение = ВладелецФайла.Подразделение;
		КонецЕсли;
	
		Если ЗначениеЗаполнено(Подразделение) Тогда
			Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ОрганизационнаяСтруктура")
				И Не ТипЗнч(Подразделение) = Тип("СправочникСсылка.СтруктураПредприятия") Тогда
				МодульОрганизационнаяСтруктура = ОбщегоНазначения.ОбщийМодуль("ОрганизационнаяСтруктура");
				Подразделение = МодульОрганизационнаяСтруктура.ПодразделениеВСтруктуреПредприятия(Подразделение);
			КонецЕсли;
			ДанныеБИАШапка.Вставить("Подразделение", Подразделение);
		КонецЕсли;
		
		ДанныеБИАШапка.Вставить("ЭтоЭлектронныйДокумент", Истина);
		ДанныеБИАШапка.Вставить("ОбъектОснование", Файл);
		
		ДанныеБИАШапка.Вставить("Заголовок", СтрШаблон(НСтр("ru = '%1'"), ДанныеБИАШапка.ВидДокумента.Наименование));
		ДанныеБИАШапка.Вставить("Содержание", СтрШаблон(НСтр("ru = '%1 (%2)'"), ДанныеБИАШапка.ВидДокумента.Наименование, ВладелецФайла.Метаданные().Синоним));
		
		ДанныеБИАСвойства = Новый Массив;
		ДанныеБИАСвойства.Добавить(Новый Структура("Значение, ИмяСвойства, ПредставлениеСвойства", ВладелецФайла.ДатаНачала, НСтр("ru='Дата начала'")));
		ДанныеБИАСвойства.Добавить(Новый Структура("Значение, ИмяСвойства, ПредставлениеСвойства", ВладелецФайла.ДатаОкончания, НСтр("ru='Дата окончания'")));
		ДанныеБИАСвойства.Добавить(Новый Структура("Значение, ИмяСвойства, ПредставлениеСвойства", ВладелецФайла.ДатаПростоя, НСтр("ru='Дата простоя'")));
		ДанныеБИАСвойства.Добавить(Новый Структура("Значение, ИмяСвойства, ПредставлениеСвойства", ВладелецФайла.ЧасыПростоя, НСтр("ru='Часы простоя'")));
		ДанныеБИАСвойства.Добавить(Новый Структура("Значение, ИмяСвойства, ПредставлениеСвойства", ВладелецФайла.ОписаниеПричины, НСтр("ru='Описание причины'")));
		
		ДанныеБИАСубъектыПД = Новый Массив;
		Для Каждого СтрокаФизическоеЛицо Из ВладелецФайла.ФизическиеЛица Цикл
			ДанныеБИАСвойства.Добавить(Новый Структура("Значение, ИмяСвойства", СтрокаФизическоеЛицо.ФизическоеЛицо, НСтр("ru='Физическое лицо'")));
			ДанныеБИАСубъектыПД.Добавить(Новый Структура("ФизическоеЛицо", СтрокаФизическоеЛицо.ФизическоеЛицо));
		КонецЦикла;
		
		ДанныеБИАФайлы = Новый Массив;
		ДанныеБИАФайлы.Добавить(Новый Структура("Файл", Файл));
		
		ДанныеБИА = Новый Структура;
		ДанныеБИА.Вставить("ДанныеБИАШапка", ДанныеБИАШапка);
		ДанныеБИА.Вставить("ДанныеБИАСвойства", ДанныеБИАСвойства);
		ДанныеБИА.Вставить("ДанныеБИАСубъектыПД", ДанныеБИАСубъектыПД);
		ДанныеБИА.Вставить("ДанныеБИАФайлы", ДанныеБИАФайлы);
		
		ДокументБИА = ИнтеграцияС1САрхивом.СоздатьДокументБИА(ДанныеБИА);
		Если Не ДокументБИА = Неопределено Тогда
			СформированныеДокументыБИА.Добавить(ДокументБИА);
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Файл) = Тип("СправочникСсылка.ТабельУчетаРабочегоВремениПрисоединенныеФайлы") Тогда
		
		СведенияОФайлах1САрхив = РегистрыСведений.СведенияОФайлах1САрхив.СведенияОФайлеДляВыгрузкиВАрхив(Файл, Истина);
		
		Если СведенияОФайлах1САрхив.НеВыгружать Тогда
			Возврат СформированныеДокументыБИА;
		КонецЕсли;
		
		ДанныеБИАШапка = Новый Структура;
		
		ДанныеБИАШапка.Вставить("ВидДокумента", СведенияОФайлах1САрхив.ВидДокументаБИА);
		ДанныеБИАШапка.Вставить("Организация", СведенияОФайлах1САрхив.Организация);
		ДанныеБИАШапка.Вставить("Дата", СведенияОФайлах1САрхив.Дата);
		
		Если Не ЗначениеЗаполнено(ДанныеБИАШапка.ВидДокумента) Или Не ЗначениеЗаполнено(ДанныеБИАШапка.Организация) Или Не ЗначениеЗаполнено(ДанныеБИАШапка.Дата) Тогда
			Возврат СформированныеДокументыБИА;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СведенияОФайлах1САрхив.Номер) Тогда
			ДанныеБИАШапка.Вставить("Номер", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(СведенияОФайлах1САрхив.Номер, Истина, Ложь));
		КонецЕсли;
		
		ВладелецФайла = Файл.ВладелецФайла;
		Подразделение = ВладелецФайла.Подразделение;
		Если ЗначениеЗаполнено(Подразделение) Тогда
			Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ОрганизационнаяСтруктура")
				И Не ТипЗнч(Подразделение) = Тип("СправочникСсылка.СтруктураПредприятия") Тогда
				МодульОрганизационнаяСтруктура = ОбщегоНазначения.ОбщийМодуль("ОрганизационнаяСтруктура");
				Подразделение = МодульОрганизационнаяСтруктура.ПодразделениеВСтруктуреПредприятия(Подразделение);
			КонецЕсли;
			ДанныеБИАШапка.Вставить("Подразделение", Подразделение);
		КонецЕсли;
		
		ДанныеБИАШапка.Вставить("ЭтоЭлектронныйДокумент", Истина);
		ДанныеБИАШапка.Вставить("ОбъектОснование", Файл);
		
		ДанныеБИАШапка.Вставить("Заголовок", СтрШаблон(НСтр("ru = '%1'"), ДанныеБИАШапка.ВидДокумента.Наименование));
		ДанныеБИАШапка.Вставить("Содержание", СтрШаблон(НСтр("ru = '%1 (%2)'"), ДанныеБИАШапка.ВидДокумента.Наименование, ВладелецФайла.Метаданные().Синоним));
		
		ДанныеБИАСвойства = Новый Массив;
		ДанныеБИАСвойства.Добавить(Новый Структура("Значение, ИмяСвойства, ПредставлениеСвойства", ВладелецФайла.ДатаНачалаПериода, НСтр("ru='Дата начала'")));
		ДанныеБИАСвойства.Добавить(Новый Структура("Значение, ИмяСвойства, ПредставлениеСвойства", ВладелецФайла.ДатаОкончанияПериода, НСтр("ru='Дата окончания'")));
		
		ДанныеБИАСубъектыПД = Новый Массив;
		Для Каждого Данные Из ВладелецФайла.ДанныеОВремени Цикл
			ДанныеБИАСвойства.Добавить(Новый Структура("Значение, ИмяСвойства", Данные.Сотрудник.ФизическоеЛицо, НСтр("ru='Физическое лицо'")));
			ДанныеБИАСубъектыПД.Добавить(Новый Структура("ФизическоеЛицо", Данные.Сотрудник.ФизическоеЛицо));
		КонецЦикла;
		
		ДанныеБИАФайлы = Новый Массив;
		ДанныеБИАФайлы.Добавить(Новый Структура("Файл", Файл));
		
		ДанныеБИА = Новый Структура;
		ДанныеБИА.Вставить("ДанныеБИАШапка", ДанныеБИАШапка);
		ДанныеБИА.Вставить("ДанныеБИАСвойства", ДанныеБИАСвойства);
		ДанныеБИА.Вставить("ДанныеБИАСубъектыПД", ДанныеБИАСубъектыПД);
		ДанныеБИА.Вставить("ДанныеБИАФайлы", ДанныеБИАФайлы);
		
		ДокументБИА = ИнтеграцияС1САрхивом.СоздатьДокументБИА(ДанныеБИА);
		Если Не ДокументБИА = Неопределено Тогда
			СформированныеДокументыБИА.Добавить(ДокументБИА);
		КонецЕсли;
	КонецЕсли;
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти
